//: [Previous](@previous)

import Foundation
/*
1) Создать тюпл с тремя параметрами, они должны быть именами параметров :
- максимальное количество отжиманий
- максимальное количество подтягиваний
- максимальное количество приседаний
Заполните его своими достижениями
Распечатайте его через print()

2) Распечатайте его через print() каждый параметр в новой строке:
"Название параметра + значение"
Причем вывод в одном случае надо делать через индекс тюпла, в другом случае через название параметра.

3) Создайте такой же тюпл для другого человека (супруги или друга) с такими же параметрами, но с другими значениями.
Используйте промежуточную переменную чтобы поменять местами соответствующие значения первого тюпла и значения второго

4) Создайте третий тюпл с теми же параметрами, но значения это разница между соответствующими значениями первого и второго тюплов.
Результат выведите в консоль
*/
/*
maximum number of push-ups
- maximum number of pull-ups
- maximum number of squats
*/
let myResultsInSports = (
    maxNumberOfPushUps: 10,
    maxNumberOfPullUps: 50,
    maxNumberOfSquats: 100)
print(myResultsInSports)
